n5/src/Documents/DocumentVersion/DocumentVersion.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>DocumentVersion</name>
  <posting>Deny</posting>
  <attributes>
    <name>AttachmentsContent</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentVersion</name>
    <type>
      <types>DocumentRef.Document</types>
    </type>
  </attributes>
  <attributes>
    <name>Data</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>FolderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsEmpty</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Link</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SpecialAccess</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Table</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Document>

n5/src/InformationRegisters/Files/Files.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Files</name>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Extension</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.Document</types>
      <types>DocumentRef.DocumentVersion</types>
    </type>
  </dimensions>
  <dimensions>
    <name>File</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Documents/DocumentVersion/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	Fields.Add ( "Subject" );
	StandardProcessing = false;
	
EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	StandardProcessing = false;
	Presentation = Metadata.Documents.DocumentVersion.Synonym + ": " + Left ( Data.Subject, 50 );
	
EndProcedure

Function Create ( Document, WeakRef = undefined ) export
	
	SetPrivilegedMode ( true );
	BeginTransaction ();
	reference = ? ( Document.IsNew (), Document.GetNewObjectRef (), Document.Ref );
	version = createVersion ( Document, reference, WeakRef );
	createAttachments ( reference, version.Ref );
	CKEditorSrv.CopyDocument ( Document.FolderID, version.FolderID );
	SetPrivilegedMode ( false );
	CommitTransaction ();
	return version.Ref;
	
EndFunction 

Function createVersion ( Document, Reference, WeakRef )
	
	version = CreateDocument ();
	FillPropertyValues ( version, Document );
	if ( WeakRef <> undefined ) then
		version.SetNewObjectRef ( WeakRef );
	endif; 
	version.SetNewNumber ();
	version.CurrentVersion = Reference;
	version.Content = new ValueStorage ( Document.Content.Get () );
	version.Data = new ValueStorage ( Document.Data.Get () );
	table = Document.Table;
	if ( table <> undefined ) then
		tabDoc = table.Get ();
		version.Table = new ValueStorage ( tabDoc, new Deflation ( 9 ) );
	endif; 
	version.FolderID  = new UUID ();
	version.Write ();
	return version;
	
EndFunction 

Procedure createAttachments ( Document, Version )
	
	recordset = InformationRegisters.Files.CreateRecordSet ();
	recordset.Filter.Document.Set ( Document );
	recordset.Read ();
	recordset2 = InformationRegisters.Files.CreateRecordSet ();
	recordset2.Filter.Document.Set ( Version );
	for each record in recordset do
		record2 = recordset2.Add ();
		FillPropertyValues ( record2, record );
		record2.Document = Version;
	enddo; 
	recordset2.Write ();
	
EndProcedure 

#endif
